/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_exit.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dhyeon <dhyeon@student.42seoul.kr>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/16 01:39:54 by dhyeon            #+#    #+#             */
/*   Updated: 2021/03/16 01:41:13 by dhyeon           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

int	ft_exit(t_state *state, t_cmd *cmd)
{
	(void)state;
	(void)cmd;
	// All Free 함수 구현후 추가
	printf("exit\n");
	exit(0);
}
